{"class_name": "Model", "keras_version": "2.1.2", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "class_name": "InputLayer"}, {"name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "filters": 16, "data_format": "channels_last", "name": "conv2d_1", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_1", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "filters": 16, "data_format": "channels_last", "name": "conv2d_2", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_2", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "filters": 16, "data_format": "channels_last", "name": "conv2d_3", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_3", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"name": "add_1", "inbound_nodes": [[["activation_1", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]], "config": {"name": "add_1", "trainable": true}, "class_name": "Add"}, {"name": "activation_3", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_4", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "filters": 16, "data_format": "channels_last", "name": "conv2d_4", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_4", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_5", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "filters": 16, "data_format": "channels_last", "name": "conv2d_5", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_5", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"name": "add_2", "inbound_nodes": [[["activation_3", 0, 0, {}], ["batch_normalization_5", 0, 0, {}]]], "config": {"name": "add_2", "trainable": true}, "class_name": "Add"}, {"name": "activation_5", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_6", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "filters": 16, "data_format": "channels_last", "name": "conv2d_6", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_6", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_7", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "filters": 16, "data_format": "channels_last", "name": "conv2d_7", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_7", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"name": "add_3", "inbound_nodes": [[["activation_5", 0, 0, {}], ["batch_normalization_7", 0, 0, {}]]], "config": {"name": "add_3", "trainable": true}, "class_name": "Add"}, {"name": "activation_7", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "filters": 16, "data_format": "channels_last", "name": "conv2d_8", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_8", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_9", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "filters": 16, "data_format": "channels_last", "name": "conv2d_9", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "batch_normalization_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_9", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"name": "add_4", "inbound_nodes": [[["activation_7", 0, 0, {}], ["batch_normalization_9", 0, 0, {}]]], "config": {"name": "add_4", "trainable": true}, "class_name": "Add"}, {"name": "activation_9", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"name": "activation_9", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "filters": 16, "data_format": "channels_last", "name": "conv2d_10", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_10", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"name": "activation_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"name": "activation_10", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_11", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "filters": 16, "data_format": "channels_last", "name": "conv2d_11", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "batch_normalization_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_11", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"name": "add_5", "inbound_nodes": [[["activation_9", 0, 0, {}], ["batch_normalization_11", 0, 0, {}]]], "config": {"name": "add_5", "trainable": true}, "class_name": "Add"}, {"name": "activation_11", "inbound_nodes": [[["add_5", 0, 0, {}]]], "config": {"name": "activation_11", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_12", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "filters": 16, "data_format": "channels_last", "name": "conv2d_12", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_12", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "config": {"name": "activation_12", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_13", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "filters": 16, "data_format": "channels_last", "name": "conv2d_13", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "batch_normalization_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_13", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"name": "add_6", "inbound_nodes": [[["activation_11", 0, 0, {}], ["batch_normalization_13", 0, 0, {}]]], "config": {"name": "add_6", "trainable": true}, "class_name": "Add"}, {"name": "activation_13", "inbound_nodes": [[["add_6", 0, 0, {}]]], "config": {"name": "activation_13", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_14", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "filters": 16, "data_format": "channels_last", "name": "conv2d_14", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "batch_normalization_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_14", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"name": "activation_14", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "config": {"name": "activation_14", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_15", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "filters": 16, "data_format": "channels_last", "name": "conv2d_15", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "batch_normalization_15", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_15", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"name": "add_7", "inbound_nodes": [[["activation_13", 0, 0, {}], ["batch_normalization_15", 0, 0, {}]]], "config": {"name": "add_7", "trainable": true}, "class_name": "Add"}, {"name": "activation_15", "inbound_nodes": [[["add_7", 0, 0, {}]]], "config": {"name": "activation_15", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_16", "inbound_nodes": [[["activation_15", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "filters": 16, "data_format": "channels_last", "name": "conv2d_16", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "batch_normalization_16", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_16", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"name": "activation_16", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "config": {"name": "activation_16", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_17", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "filters": 16, "data_format": "channels_last", "name": "conv2d_17", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "batch_normalization_17", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_17", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"name": "add_8", "inbound_nodes": [[["activation_15", 0, 0, {}], ["batch_normalization_17", 0, 0, {}]]], "config": {"name": "add_8", "trainable": true}, "class_name": "Add"}, {"name": "activation_17", "inbound_nodes": [[["add_8", 0, 0, {}]]], "config": {"name": "activation_17", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_18", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "filters": 16, "data_format": "channels_last", "name": "conv2d_18", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "batch_normalization_18", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_18", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"name": "activation_18", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "config": {"name": "activation_18", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_19", "inbound_nodes": [[["activation_18", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "filters": 16, "data_format": "channels_last", "name": "conv2d_19", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "batch_normalization_19", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_19", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"name": "add_9", "inbound_nodes": [[["activation_17", 0, 0, {}], ["batch_normalization_19", 0, 0, {}]]], "config": {"name": "add_9", "trainable": true}, "class_name": "Add"}, {"name": "activation_19", "inbound_nodes": [[["add_9", 0, 0, {}]]], "config": {"name": "activation_19", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_20", "inbound_nodes": [[["activation_19", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "filters": 16, "data_format": "channels_last", "name": "conv2d_20", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "batch_normalization_20", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_20", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"name": "activation_20", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "config": {"name": "activation_20", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_21", "inbound_nodes": [[["activation_20", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "filters": 16, "data_format": "channels_last", "name": "conv2d_21", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "batch_normalization_21", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_21", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"name": "add_10", "inbound_nodes": [[["activation_19", 0, 0, {}], ["batch_normalization_21", 0, 0, {}]]], "config": {"name": "add_10", "trainable": true}, "class_name": "Add"}, {"name": "activation_21", "inbound_nodes": [[["add_10", 0, 0, {}]]], "config": {"name": "activation_21", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_22", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "filters": 16, "data_format": "channels_last", "name": "conv2d_22", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "batch_normalization_22", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_22", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"name": "activation_22", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "config": {"name": "activation_22", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_23", "inbound_nodes": [[["activation_22", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "filters": 16, "data_format": "channels_last", "name": "conv2d_23", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "batch_normalization_23", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_23", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"name": "add_11", "inbound_nodes": [[["activation_21", 0, 0, {}], ["batch_normalization_23", 0, 0, {}]]], "config": {"name": "add_11", "trainable": true}, "class_name": "Add"}, {"name": "activation_23", "inbound_nodes": [[["add_11", 0, 0, {}]]], "config": {"name": "activation_23", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_24", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "filters": 16, "data_format": "channels_last", "name": "conv2d_24", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "batch_normalization_24", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_24", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"name": "activation_24", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "config": {"name": "activation_24", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_25", "inbound_nodes": [[["activation_24", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "filters": 16, "data_format": "channels_last", "name": "conv2d_25", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "batch_normalization_25", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_25", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"name": "add_12", "inbound_nodes": [[["activation_23", 0, 0, {}], ["batch_normalization_25", 0, 0, {}]]], "config": {"name": "add_12", "trainable": true}, "class_name": "Add"}, {"name": "activation_25", "inbound_nodes": [[["add_12", 0, 0, {}]]], "config": {"name": "activation_25", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_26", "inbound_nodes": [[["activation_25", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "filters": 16, "data_format": "channels_last", "name": "conv2d_26", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "batch_normalization_26", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_26", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"name": "activation_26", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "config": {"name": "activation_26", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_27", "inbound_nodes": [[["activation_26", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "filters": 16, "data_format": "channels_last", "name": "conv2d_27", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "batch_normalization_27", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_27", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"name": "add_13", "inbound_nodes": [[["activation_25", 0, 0, {}], ["batch_normalization_27", 0, 0, {}]]], "config": {"name": "add_13", "trainable": true}, "class_name": "Add"}, {"name": "activation_27", "inbound_nodes": [[["add_13", 0, 0, {}]]], "config": {"name": "activation_27", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_28", "inbound_nodes": [[["activation_27", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "filters": 16, "data_format": "channels_last", "name": "conv2d_28", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "batch_normalization_28", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_28", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"name": "activation_28", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "config": {"name": "activation_28", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_29", "inbound_nodes": [[["activation_28", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "filters": 16, "data_format": "channels_last", "name": "conv2d_29", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "batch_normalization_29", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_29", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"name": "add_14", "inbound_nodes": [[["activation_27", 0, 0, {}], ["batch_normalization_29", 0, 0, {}]]], "config": {"name": "add_14", "trainable": true}, "class_name": "Add"}, {"name": "activation_29", "inbound_nodes": [[["add_14", 0, 0, {}]]], "config": {"name": "activation_29", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_30", "inbound_nodes": [[["activation_29", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "filters": 16, "data_format": "channels_last", "name": "conv2d_30", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "batch_normalization_30", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_30", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"name": "activation_30", "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]], "config": {"name": "activation_30", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_31", "inbound_nodes": [[["activation_30", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "filters": 16, "data_format": "channels_last", "name": "conv2d_31", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "batch_normalization_31", "inbound_nodes": [[["conv2d_31", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_31", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, 