{"backend": "tensorflow", "class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 32, 32, 3], "sparse": false}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_1", "dilation_rate": [1, 1], "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}}, "use_bias": true, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_1", "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_1", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_2", "dilation_rate": [1, 1], "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}}, "use_bias": true, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_2", "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_2", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_3", "dilation_rate": [1, 1], "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}}, "use_bias": true, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_3", "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_1", "config": {"trainable": true, "name": "add_1"}, "inbound_nodes": [[["activation_1", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_3", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_4", "config": {"trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_4", "dilation_rate": [1, 1], "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}}, "use_bias": true, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_4", "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_4", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_5", "config": {"trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_5", "dilation_rate": [1, 1], "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}}, "use_bias": true, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_5", "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_2", "config": {"trainable": true, "name": "add_2"}, "inbound_nodes": [[["activation_3", 0, 0, {}], ["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_5", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_6", "config": {"trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_6", "dilation_rate": [1, 1], "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}}, "use_bias": true, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_6", "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_6", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_7", "config": {"trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_7", "dilation_rate": [1, 1], "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}}, "use_bias": true, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_7", "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_3", "config": {"trainable": true, "name": "add_3"}, "inbound_nodes": [[["activation_5", 0, 0, {}], ["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_7", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_8", "config": {"trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_8", "dilation_rate": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}}, "use_bias": true, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2]}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_8", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_8", "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_8", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_9", "config": {"trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_9", "dilation_rate": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}}, "use_bias": true, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_10", "config": {"trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_10", "dilation_rate": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}}, "use_bias": true, "bias_regularizer": null, "kernel_size": [1, 1], "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2]}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_9", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_9", "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_4", "config": {"trainable": true, "name": "add_4"}, "inbound_nodes": [[["conv2d_10", 0, 0, {}], ["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_9", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_11", "config": {"trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_11", "dilation_rate": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}}, "use_bias": true, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_10", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_10", "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_10", "config": {"trainable": true, "name": "activation_10", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_12", "config": {"trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_12", "dilation_rate": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}}, "use_bias": true, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_11", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_11", "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_5", "config": {"trainable": true, "name": "add_5"}, "inbound_nodes": [[["activation_9", 0, 0, {}], ["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_11", "config": {"trainable": true, "name": "activation_11", "activation": "relu"}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_13", "config": {"trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_13", "dilation_rate": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}}, "use_bias": true, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_12", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_12", "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_12", "config": {"trainable": true, "name": "activation_12", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_14", "config": {"trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_14", "dilation_rate": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}}, "use_bias": true, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_13", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_13", "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_6", "config": {"trainable": true, "name": "add_6"}, "inbound_nodes": [[["activation_11", 0, 0, {}], ["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_13", "config": {"trainable": true, "name": "activation_13", "activation": "relu"}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_15", "config": {"trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_15", "dilation_rate": [1, 1], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}}, "use_bias": true, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2]}, "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_14", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_14", "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_14", "config": {"trainable": true, "name": "activation_14", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_16", "config": {"trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_16", "dilation_rate": [1, 1], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}}, "use_bias": true, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_17", "config": {"trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_17", "dilation_rate": [1, 1], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}}, "use_bias": true, "bias_regularizer": null, "kernel_size": [1, 1], "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2]}, "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_15", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_15", "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_7", "config": {"trainable": true, "name": "add_7"}, "inbound_nodes": [[["conv2d_17", 0, 0, {}], ["batch_normalization_15", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_15", "config": {"trainable": true, "name": "activation_15", "activation": "relu"}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_18", "config": {"trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_18", "dilation_rate": [1, 1], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}}, "use_bias": true, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "inbound_nodes": [[["activation_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_16", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_16", "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_16", "config": {"trainable": true, "name": "activation_16", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_19", "config": {"trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_19", "dilation_rate": [1, 1], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}}, "use_bias": true, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_17", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_17", "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_8", "config": {"trainable": true, "name": "add_8"}, "inbound_nodes": [[["activation_15", 0, 0, {}], ["batch_normalization_17", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_17", "config": {"trainable": true, "name": "activation_17", "activation": "relu"}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_20", "config": {"trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_20", "dilation_rate": [1, 1], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}}, "use_bias": true, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_18", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_18", "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_18", "config": {"trainable": true, "name": "activation_18", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_21", "config": {"trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_21", "dilation_rate": [1, 1], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}}, "use_bias": true, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "inbound_nodes": [[["activation_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_19", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_19", "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_9", "config": {"trainable": true, "name": "add_9"}, "inbound_nodes": [[["activation_17", 0, 0, {}], ["batch_normalization_19", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_19", "config": {"trainable": true, "name": "activation_19", "activation": "relu"}, "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_1", "config": {"trainable": true, "pool_size": [8, 8], "strides": [8, 8], "data_format": "channels_last", "name": "average_pooling2d_1", "padding": "valid"}, "inbound_nodes": [[["activation_19", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_1", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "units": 10, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 2.0, "mode": "fan_in"}}, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "softmax", "name": "dense_1"}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}], "name": "model_1", "output_layers": [["dense_1", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "keras_version": "2.0.4"}