{"config": {"layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "sparse": false, "name": "input_1", "dtype": "float32"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "filters": 16, "name": "conv2d_1", "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"center": true, "scale": true, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "beta_regularizer": null, "name": "batch_normalization_1", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv2d_2", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "filters": 16, "name": "conv2d_2", "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"center": true, "scale": true, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "beta_regularizer": null, "name": "batch_normalization_2", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "conv2d_3", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "filters": 16, "name": "conv2d_3", "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}}}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"center": true, "scale": true, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "beta_regularizer": null, "name": "batch_normalization_3", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}}, {"inbound_nodes": [[["activation_1", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]], "name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true}}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "conv2d_4", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "filters": 16, "name": "conv2d_4", "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}}}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"center": true, "scale": true, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "beta_regularizer": null, "name": "batch_normalization_4", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "conv2d_5", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "filters": 16, "name": "conv2d_5", "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}}}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"center": true, "scale": true, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "beta_regularizer": null, "name": "batch_normalization_5", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}}, {"inbound_nodes": [[["activation_3", 0, 0, {}], ["batch_normalization_5", 0, 0, {}]]], "name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true}}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "conv2d_6", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "filters": 16, "name": "conv2d_6", "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}}}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"center": true, "scale": true, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "beta_regularizer": null, "name": "batch_normalization_6", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "conv2d_7", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "filters": 16, "name": "conv2d_7", "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}}}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"center": true, "scale": true, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "beta_regularizer": null, "name": "batch_normalization_7", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}}, {"inbound_nodes": [[["activation_5", 0, 0, {}], ["batch_normalization_7", 0, 0, {}]]], "name": "add_3", "class_name": "Add", "config": {"name": "add_3", "trainable": true}}, {"inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "activation_7", "class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "conv2d_8", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [2, 2], "filters": 32, "name": "conv2d_8", "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}}}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"center": true, "scale": true, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "beta_regularizer": null, "name": "batch_normalization_8", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "name": "activation_8", "class_name": "Activation", "config": {"name": "activation_8", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_8", 0, 0, {}]]], "name": "conv2d_9", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "filters": 32, "name": "conv2d_9", "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}}}, {"inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "conv2d_10", "class_name": "Conv2D", "config": {"kernel_size": [1, 1], "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [2, 2], "filters": 32, "name": "conv2d_10", "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}}}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"center": true, "scale": true, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "beta_regularizer": null, "name": "batch_normalization_9", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}], ["batch_normalization_9", 0, 0, {}]]], "name": "add_4", "class_name": "Add", "config": {"name": "add_4", "trainable": true}}, {"inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "activation_9", "class_name": "Activation", "config": {"name": "activation_9", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "conv2d_11", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "filters": 32, "name": "conv2d_11", "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}}}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"center": true, "scale": true, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "beta_regularizer": null, "name": "batch_normalization_10", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "name": "activation_10", "class_name": "Activation", "config": {"name": "activation_10", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "conv2d_12", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "filters": 32, "name": "conv2d_12", "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}}}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"center": true, "scale": true, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "beta_regularizer": null, "name": "batch_normalization_11", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}}, {"inbound_nodes": [[["activation_9", 0, 0, {}], ["batch_normalization_11", 0, 0, {}]]], "name": "add_5", "class_name": "Add", "config": {"name": "add_5", "trainable": true}}, {"inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "activation_11", "class_name": "Activation", "config": {"name": "activation_11", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_11", 0, 0, {}]]], "name": "conv2d_13", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "filters": 32, "name": "conv2d_13", "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}}}, {"inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"center": true, "scale": true, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "beta_regularizer": null, "name": "batch_normalization_12", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}}, {"inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "name": "activation_12", "class_name": "Activation", "config": {"name": "activation_12", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_12", 0, 0, {}]]], "name": "conv2d_14", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "filters": 32, "name": "conv2d_14", "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}}}, {"inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"center": true, "scale": true, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "beta_regularizer": null, "name": "batch_normalization_13", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}}, {"inbound_nodes": [[["activation_11", 0, 0, {}], ["batch_normalization_13", 0, 0, {}]]], "name": "add_6", "class_name": "Add", "config": {"name": "add_6", "trainable": true}}, {"inbound_nodes": [[["add_6", 0, 0, {}]]], "name": "activation_13", "class_name": "Activation", "config": {"name": "activation_13", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_13", 0, 0, {}]]], "name": "conv2d_15", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [2, 2], "filters": 64, "name": "conv2d_15", "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}}}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "batch_normalization_14", "class_name": "BatchNormalization", "config": {"center": true, "scale": true, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "beta_regularizer": null, "name": "batch_normalization_14", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}}, {"inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "name": "activation_14", "class_name": "Activation", "config": {"name": "activation_14", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_14", 0, 0, {}]]], "name": "conv2d_16", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "filters": 64, "name": "conv2d_16", "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}}}, {"inbound_nodes": [[["activation_13", 0, 0, {}]]], "name": "conv2d_17", "class_name": "Conv2D", "config": {"kernel_size": [1, 1], "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [2, 2], "filters": 64, "name": "conv2d_17", "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}}}, {"inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "batch_normalization_15", "class_name": "BatchNormalization", "config": {"center": true, "scale": true, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "beta_regularizer": null, "name": "batch_normalization_15", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}}, {"inbound_nodes": [[["conv2d_17", 0, 0, {}], ["batch_normalization_15", 0, 0, {}]]], "name": "add_7", "class_name": "Add", "config": {"name": "add_7", "trainable": true}}, {"inbound_nodes": [[["add_7", 0, 0, {}]]], "name": "activation_15", "class_name": "Activation", "config": {"name": "activation_15", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_15", 0, 0, {}]]], "name": "conv2d_18", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "filters": 64, "name": "conv2d_18", "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}}}, {"inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "name": "batch_normalization_16", "class_name": "BatchNormalization", "config": {"center": true, "scale": true, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "beta_regularizer": null, "name": "batch_normalization_16", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}}, {"inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "name": "activation_16", "class_name": "Activation", "config": {"name": "activation_16", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_16", 0, 0, {}]]], "name": "conv2d_19", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "filters": 64, "name": "conv2d_19", "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}}}, {"inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "name": "batch_normalization_17", "class_name": "BatchNormalization", "config": {"center": true, "scale": true, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "beta_regularizer": null, "name": "batch_normalization_17", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}}, {"inbound_nodes": [[["activation_15", 0, 0, {}], ["batch_normalization_17", 0, 0, {}]]], "name": "add_8", "class_name": "Add", "config": {"name": "add_8", "trainable": true}}, {"inbound_nodes": [[["add_8", 0, 0, {}]]], "name": "LastAct", "class_name": "Activation", "config": {"name": "LastAct", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["LastAct", 0, 0, {}]]], "name": "average_pooling2d_1", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_1", "data_format": "channels_last", "pool_size": [8, 8], "trainable": true, "padding": "valid", "strides": [8, 8]}}, {"inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "name": "flatten_4", "class_name": "Flatten", "config": {"name": "flatten_4", "trainable": true}}, {"inbound_nodes": [[["flatten_4", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense", "config": {"units": 10, "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_1", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_regularizer": null, "activation": "softmax"}}], "name": "model_2", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.1.2"}